/* ЗДЕСЬ БУДУТ ПИСАТЬСЯ КОДЫ СООБЩЕНИЙ, КОТОРЫМИ ОБМЕНИВАЮТСЯ КЛИЕНТ И СЕРВЕР
 Field 1 = 0 Field 2 = 1 Просьба предоставить имя игрока
 Field 1 = 0 Field 2 = 2 Просьба предоставить список ресурсов
 Field 1 = 0 Field 2 = 3 Просьба предоставить базовый спискок исследований 
 Field 1 = 0 Field 2 = 4 Просьба предоставить список исследований
 Field 1 = 0 Field 2 = 5 Просьба предоставить Хэш Архива1
 Field 1 = 0 Field 2 = 6 Просьба предоставить константу максимального числа исследований необходимого для открытия следующего уровня
 Field 1 = 0 Field 2 = 7 Просьба предоставить базу для вычисления стоимости исследований
 Field 1 = 0 Field 2 = 8 Просьба предоставить список уведомлений
 Field 1 = 0 Field 2 = 9 Просьба предоставить базовую информацю по клану (ID, Image, Имя)
 Field 1 = 0 Field 2 = 10 Просьба предоставить список миссий
 Field 1 = 0 Field 2 = 11 Просьба предоставить список помощи
 Field 1 = 0 Field 2 = 12 Просьба обновить помощь
 Field 1 = 0 Field 2 = 13 Просьба предоставить позицию сюжета
 Field 1 = 0 Field 2 = 14 Просьба предоставить миссии2
 Field 1 = 0 Field 2 = 15 Просьби предоставить статистику по сторонам. Не в составе общей информации
 Field 1 = 1 Field 2 = 1 Просьба обработать событие по изучению новой технологии
 Field 1 = 2 Field 2 = 1 Просьба принять сообщение для клана
 Field 1 = 2 Field 2 = 2 Просьба принять приватное сообщение
 Field 1 = 2 Field 2 = 3 Просьба принять общее сообщение
 Field 1 = 2 Field 2 = 4 Просьба предоставить список сообщений чата
 Field 1 = 3 Field 2 = 1 Просьба принять список корабельных схем
 Field 1 = 3 Field 2 = 2 Просьба предоставить список корабельных схем
 Field 1 = 3 Field 2 = 3 Просьба построить корабль
 Field 1 = 3 Field 2 = 4 Просьба предоставить список кораблей
 Field 1 = 3 Field 2 = 5 Просьба отремонтировать корабль
 Field 1 = 3 Field 2 = 6 Просьба убрать корабль
 Field 1 = 4 Field 2 = 1 Просьба предоставить список земель
 Field 1 = 4 Field 2 = 2 Просьба принять запрос о строительстве здания
 Field 1 = 4 Field 2 = 3 Просьба принять запрос о сносе здания
 Field 1 = 4 Field 2 = 4 Просьюа принять запрос о улучшении здания
 Field 1 = 4 Field 2 = 5 Просьюа принять запрос о смене секторов
 Field 1 = 4 Field 2 = 6 Просьба принять сообщение о смене имени колонии
 Field 1 = 4 Field 2 = 7 Просьба предоставить список новых колоний
 Field 1 = 4 Field 2 = 8 Просьба принять запрос о достройке в новой колонии
 Field 1 = 5 Field 2 = 1 Просьба предоставить цены рынка
 Field 1 = 5 Field 2 = 2 Просьба обменять ресурсы
 Field 1 = 5 Field 2 = 3 Просьба создать новый клан
 Field 1 = 5 Field 2 = 4 Просьба предоставить список кланов
 Field 1 = 5 Field 2 = 5 Просьба предоставить список членов клана
 Field 1 = 5 Field 2 = 6 Просьба покинуть клан
 Field 1 = 5 Field 2 = 7 Просьба принять заявку на вступление в клан
 Field 1 = 5 Filed 2 = 8 Просьба отозвать заявку на вступление в клан
 Field 1 = 5 Field 2 = 9 Просьба предоставить список завявок в клан
 Field 1 = 5 Field 2 = 10 Просьба принять игрока в клан
 Field 1 = 5 Field 2 = 11 Просьба отклонить заяку в клан
 Field 1 = 5 Field 2 = 12 Просьба выгнать игрока из клана
 Field 1 = 6 Field 2 = 1 Просьба предоставить список новых пилотов
 Field 1 = 6 Field 2 = 2 Просьба сменить выпуск пилотов
 Field 1 = 6 Field 2 = 3 Просьба нанять пилота
 Field 1 = 6 Field 2 = 4 Просьба предоставить список свободных пилотов
 Field 1 = 6 Field 2 = 5 Просьба уволить пилота
 Field 1 = 6 Field 2 = 6 Просьба посадить пилота в корабль
 Field 1 = 6 Field 2 = 7 Просьбы высадить пилота из корабля
 Field 1 = 6 Field 2 = 8 Просьба предоставить информацию о рынках
 Field 1 = 6 Field 2 = 9 Просьба произвести обмен на новом рынке
 Field 1 = 6 Field 2 = 10 Просьба покинуть рынок
 Field 1 = 6 Field 2 = 11 Просьба создать новый галактический рынок
 Field 1 = 7 Field 2 = 1 Просьба создать флот
 Field 1 = 7 Field 2 = 2 Просьба предоставить список флотов
 Field 1 = 7 Field 2 = 3 Просьба поместить корабль во флот
 Field 1 = 7 Field 2 = 4 Просьба поменять параметры флота
 Field 1 = 7 Field 2 = 5 Просьба извлечь корабль из флота
 Field 1 = 8 Field 2 = 0 Просьба предоставить базовый список боёв
 Field 1 = 8 Field 2 = 1 Просьба начать бой с вторжением
 Field 1 = 8 Field 2 = 2 Просьба принять запрос о направлении флота на колонизацию
 Field 1 = 8 Field 2 = 3 Просьба направить флот на защиту собственных колоний
 Field 1 = 8 Field 2 = 4 Просьба вернуть флот с патрулирования
 Field 1 = 8 Field 2 = 5 Просьба послать флот на грабёж
 Field 1 = 8 Field 2 = 6 Просьба поставить флот защитником колонии
 Field 1 = 8 Field 2 = 7 Просьба убрать флот с роли защитника колонии
 Field 1 = 8 Field 2 = 8 Просьба послать флот на захват колонии
 Field 1 = 8 Field 2 = 9 Просьба послать флот на ресусрную миссию
 Field 1 = 8 Field 2 = 10 Просьба послать флот на сюжетную миссию
 Field 1 = 8 Field 2 = 11 Просьба послать флот на патрулирование звезды
 Field 1 = 8 Field 2 = 12 Просьба отправить флот на миссию2
 Field 1 = 9 Field 2 = 0 Просьба предоставить список Заражённых звёзд
 Field 1 = 9 Field 2 = 1 Просьба предоставить список колоний для планеты
 Field 1 = 9 Field 2 = 2 Просьба предоставить список свободных звёзд
 Field 1 = 9 Filed 2 = 4 Просьба предоставить информацию о всех планетах
 Field 1 = 10 Field 2 = 0 Просьба предоставить информацию о премиуме
 Field 1 = 10 Field 2 = 1 Просьба принять информацию о активации премиума
 Field 1 = 10 Field 2 = 2 Просьба предоставить информацию о логах боя
 Field 1 = 10 Field 2 = 3 Просьба предоставить информацию о квестах
 Filed 1 = 10 Field 2 = 4 Просьба принять информацию о завершении простого квеста
 Field 1 = 11 Field 2 = 0 Перечень артефактов в общем массиве
 Field 1 = 11 Field 2 = 1 Просьба использовать мирный артефакт
 Field 1 = 11 Field 2 = 2 Просьба поместить военный артефакт во флот
 Field 1 = 11 Field 2 = 3 Просьба убрать артефакт из флота
 
 Энергетическое оружие
 Лазерное оружие - Эффект: Ослепление - Снижение точности следующего хода.
 ЭМИ - Эффект: Ионизация - Можно применять по своим, восстанавливает энергию
 Плазма - Эффект: Критический урон - Наносит двойной урон.
 ДОП Солнечная пушка - Эффект: Ожог - Эффекты поглощения не работают до конца боя.
 Физическое оружие
 Пушки - Эффект: Сотрясение - Корабль пропускает следующий ход.
 Гаусс - Эффект: Проникающий урон - Наносит урон по здоровью сквозь щит.
 Ракеты - Эффект: Разлёт осколков - Наносит урон двум соседним целям.
 ДОП Антиматерия: Аннигиляция - Наносит тройной урон.
 Аномальное оружие
 Пси - Эффект: Помрачнение - Корабль следующим ходом атакует соседей.
 Тёмная материя - Эффект: Перегрузка - Корабль не может регенерировать щит до конца боя.
 Черные дыры - Эффект: Портал - Корабль выкидывает из боя.
 ДОП Временное оружие - Эффект: Парадокс - Снимает все отрицательные эффекты с группы кораблей.
 Кибернетическое оружие
 Хакерство - Эффект: Блокировка - Корабль не может стрелять следующим ходом.
 Радиация - Эффект: Заражение - Урон каждый ход до конца боя.
 Дроны - Эффект: Лечение - Можно применять к своим для восстановления здоровья.
 ДОП Магнитное оружие - Эффект: Магнитизм - Корабль может наносить урон сам себе до конца боя.
 Hex - 0-66 - действующие ячейки
 200 - корабль на базе
 201 - в гейте, очередь 1
 202 - в гейте, очередь 2
 203 - в гейте, очередь 3
 210 - покинул поле боя
 211 - готов к прыжку в ряд №1
 212 - готов к прыжку в ряд №2
 213 - готов к прыжку в ряд №3
 220 - уничтожен
 
 FreeTime Флотов
 0 - свободен,
 >0 - время возвращения
 -1 - битва с глобальным врагом
 
 Варианты дополнений к игре
 Новые объекты в бою - 
 статичные корабли, базы (много хп, щитов мало), оружейные платформы (большой корабль с высокими параметрами)
 Разные типы боёв - 
 уничтожение конвоя - статично стоящие цели, уничтожение которых выполняет цель миссии
 (при покидании всех атакующих с поля боя - конец боя)
 защита конвоя - статично стоящие цели, потеря которых вызывает поражение
 (при покидании всех атакующих с поля боя - конец боя)
 атака пиратской верфи (большая база)
 атака пиратской базы (орудийная платформа)
 атака базы чужих (большая база)
 поиск артефактов древних (орудийная платформа)
 Элементы схем добавляющие несколько параметров
 Захватываемые артефакты, дающие тот или иной бонус, артефакты отображаются на карте галактики
 Новые вооружения - торпеды и десантные боты. Особенность - летят несколько ходов и их можно сбить.
 Торпеда - наносит очень большой урон, смертельный для многих кораблей.
 Десантный бот - переводит корабль под управление соперника на несколько ходов или до конца боя.
 */


/*
Версия клиента 3:
Иправлен баг, вызывающий падение клиента у некоторых пользователей
Версия клиента 2:
Большое изменение графических элементов.
Изменён стартовый экран.
Исправление некоторых багов.
Добавлено: изменение параметров флота при направлении в атаку.
Добавлено: прирост ресурсов, населения и ремонт продолжаются в течение 4 часов после последнего захода в игру (для премиума - 24 часа).
Небольшие изменения в балансе построек.
Небольшие изменения в балансе орудий.
Приведено в соответствие описание построек.
Добавлена новая кнопка атаки - позволяет сначала выбрать цель, а затем поочерёдно свои корабли, которые будут эту цель атаковать.
*/